jayis1/daily-ideas/systems/soc-devices/bolt-compass/firmware/sdkconfig.defaults
# Bolt Compass — ESP32-S3 sdkconfig defaults
#
# Stack: ESP-IDF v5.2, ESP32-S3-WROOM-1 (N16R8 = 16 MB flash, 8 MB octal PSRAM)

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash / PSRAM ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCTAL=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# --- Wi-Fi ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_MODE_APSTA=y
CONFIG_ESP_WIFI_AP_NUM=1

# --- BLE (NimBLE) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# --- FatFS / SD ---
CONFIG_FATFS_LFN_ENABLE=y
CONFIG_FATFS_CODEPAGE_437=y

# --- mDNS ---
CONFIG_MDNS_ENABLED=y

# --- Light sleep ---
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_ESP_SLEEP_ENABLE_RAM_SPI_DEEP_SLEEP=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y